/*
Створи дані:
Створи масив students, який містить 3-4 об'єкти.
Кожен об'єкт-студент повинен мати такі властивості: id (число), name (рядок), age (число), isProgrammer (булеве).
Виконай маніпуляції (використовуй console.log після кожного кроку, щоб бачити результат):
Перевір, чи всі студенти є програмістами? Ми цього методу не проходили, але він логічний: students.every(student => student.isProgrammer). Просто спробуй.
Додай нового студента: За допомогою методу .push() додай в масив ще одного студента.
Знайди студента за id: Використовуючи метод .find(), знайди студента з id, наприклад, 2.
Створи масив імен: Використовуючи метод .map(), створи новий масив, який буде містити тільки імена всіх студентів.
Відфільтруй повнолітніх: Використовуючи метод .filter(), створи новий масив, в якому будуть тільки студенти, старші за 18 років.
Виведи інформацію про кожного: Використовуючи метод .forEach(), виведи в консоль рядок для кожного студента у форматі: "Студент [Ім'я], вік [Вік].".
*/
