/**
 * Практичне завдання: Біографія користувача
 * Твоє завдання – написати функцію, яка приймає об'єкт користувача і виводить його біографію, використовуючи всі щойно вивчені техніки.
 * Інструкції:
 * 1. Створи об'єкт user:
 * ...
 * 2. Створи функцію printUserBio:
 *  Ця функція має приймати один аргумент – об'єкт користувача.
 *  Використай деструктуризацію прямо в списку параметрів, щоб одразу "дістати" з об'єкта firstName, age та skills.
 *  Всередині функції, використай деструктуризацію масиву skills, щоб дістати перший навик (firstSkill) і решту навиків (...otherSkills) в окремі змінні.
 *  Виведи в консоль кілька рядків інформації про користувача, використовуючи ці змінні.
 * 1. Бонусне завдання (Spread):
 *  Після виклику функції, створи новий об'єкт userWithLocation на основі існуючого user, але з доданою властивістю location: 'New York'. Використовуй оператор spread.
 *  Виведи новий об'єкт в консоль.
 */
